{
  "candidate-name": "Cedric Legara",
  "job-title": "Fullstack Developer | Game Developer on the Side",
  "links": [
    {
      "display": "legara.connect@gmail.com",
      "destination": "mailto:legara.connect@gmail.com"
    },
    {
      "display": "0919 243 2123",
      "destination": "tel:+639192432123"
    },
    {
      "display": "github.com/shankencedric",
      "destination": "https://github.com/shankencedric"
    },
    {
      "display": "linkedin.com/in/shankencedric",
      "destination": "https://www.linkedin.com/in/shankencedric/"
    },
    {
      "display": "yummypecho.itch.io",
      "destination": "https://yummypecho.itch.io/"
    }
  ],
  "sections": [
    {
      "title": "Summary",
      "subsections": [
        {
          "text": "BS Computer Science student with hands-on experience building full-stack web and mobile apps and games. Adaptable team player with a passion for meaningful and maintainable code."
        }
      ]
    },
    {
      "title": "Skills",
      "subsections": [
        {
          "items": {
            "Programming Languages": "C, C#, Python, TypeScript, JavaScript",
            "Front-end Development": "React (with Ionic and React Native), Svelte & SvelteKit",
            "Back-end Development": "MySQL, PostgreSQL, Supabase",
            "Development Practices": "Version Control (Git, GitHub), Agile Methodology, Documentation",
            "Soft Skills": "Flexibility, Effective Communication, Continuous Improvement, Receptive to Feedback, Problem-solving"
          }
        }
      ]
    },
    {
      "title": "Education",
      "subsections": [
        {
          "title": "Bachelor of Science in Computer Science",
          "subtitle": "University of the Philippines - Diliman",
          "from": {
            "year": 2022,
            "month": 8
          },
          "items": [
            "Magna Cum Laude standing (GWA 1.6)",
            "DOST Merit Scholar"
          ]
        }
      ]
    },
    {
      "title": "Projects",
      "subsections": [
        {
          "title": "Metrocycle 2.0",
          "subtitle": "Road-safety Mobile Game | UI/UX, Accessibility, Thesis, Team of 3",
          "from": {
            "year": 2024,
            "month": 8
          },
          "to": {
            "year": 2025,
            "month": 6
          },
          "items": [
            "Collaborated with 2 teammates to expand Metrocycle, a motorcycle road-safety game originally built for web.",
            "Defined development goals by identifying gaps and pain points through research and brainstorming.",
            "Redesigned the UI/UX and broadened the game's educational scope and accessibility.",
            "Led the initial Android port, restoring broken features and improving overall performance.",
            "Co-managed Unity project development, focusing on the creation of scalable systems like a centralized text and translation handler driven by editable CSV files.",
            "Documented the entire software process to support future development and maintenance.",
            "Fostered open communication within the team, resolving conflicts and keeping focus aligned with project goals."
          ]
        },
        {
          "title": "FLCD eLaan",
          "subtitle": "Department Requests Website | Fullstack, Agile, Internship, Team of 5",
          "from": {
            "year": 2024,
            "month": 7
          },
          "to": {
            "year": 2024,
            "month": 8
          },
          "items": [
            "Initiated a freelance-style internship with a university department alongside 4 coursemates.",
            "Co-led an agile development process, maintaining active communication with both the client and team.",
            "Designed and implemented the foundational backend systems, including database schema design.",
            "Developed an extensive forms page in both the frontend and its backend integration using SvelteKit.",
            "Learned Svelte, SvelteKit, and PostgreSQL on-demand to meet the project needs."
          ]
        },
        {
          "title": "Labuddy",
          "subtitle": "IoT-accompanying Web App | Backend, IoT, Dragon's Den, Team of 6",
          "from": {
            "year": 2024,
            "month": 2
          },
          "to": {
            "year": 2024,
            "month": 6
          },
          "items": [
            "Led backend development for a web companion app designed to support an IoT hardware prototype.",
            "Engineered a secure and scalable backend using Supabase and MySQL.",
            "Integrated backend APIs into the web frontend using React Native.",
            "Assisted in the frontend design and user flow to ensure seamless hardware-software interaction.",
            "Pitched the project in a high-stakes Dragon’s Den-style presentation, focusing on technical feasibility and value."
          ]
        },
        {
          "title": "RollCall",
          "subtitle": "Class Attendance Mobile App | Fullstack, Agile, Team of 4",
          "from": {
            "year": 2023,
            "month": 9
          },
          "to": {
            "year": 2024,
            "month": 6
          },
          "items": [
            "Developed an Android application that automates class attendance using QR code scanning.",
            "Led backend implementation via Supabase, managing authentication, attendance logging, and class data storage.",
            "Collaborated on frontend integration to ensure intuitive user interactions and accurate data flow.",
            "Maintained an agile methodology workflow with weekly standups and iterative feedback from the client."
          ]
        },
        {
          "title": "Game Development Projects",
          "subtitle": "Game Jams, Fast Prototype, Booth Presentation",
          "from": {
            "year": 2021,
            "month": 2
          },
          "to": {
            "year": 2024,
            "month": 12
          },
          "items": [
            "Developed games for multiple DevelUP game jams, collaborating with peers to create themed prototypes within 7-day sprints.",
            "Selected and refined one jam entry into a more accessible and polished build for public demonstration at ConQuest 2023.",
            "Presented games from the org at the convention, guiding attendees through gameplay and fostering discussions and connections."
          ]
        }
      ]
    }
  ],
  "style": {
    "font": "Noto Sans",
    "font-size": "9pt",
    "header-color": "#000035",
    "divider-color": "#800000"
  }
}