{
  "candidate-name": "Cedric Legara",
  "job-title": "Fullstack Web & Software Developer",
  "links": [
    {
      "display": "legara.connect@gmail.com",
      "destination": "mailto:legara.connect@gmail.com"
    },
    {
      "display": "+639192432123",
      "destination": "tel:+639192432123"
    },
    {
      "display": "github:shankencedric",
      "destination": "https://github.com/shankencedric"
    },
    {
      "display": "linkedin:shankencedric",
      "destination": "https://www.linkedin.com/in/shankencedric/"
    }
  ],
  "sections": [
    {
      "title": "Summary",
      "subsections": [
        {
          "text": "Graduating BS Computer Science student from the University of the Philippines Diliman with strong fullstack development experience building production-ready web and software applications used in real environments. Skilled in designing scalable backend systems, integrating APIs, and delivering clean, maintainable code. Proven ability to work in agile teams, communicate with stakeholders, and ship end-to-end features from database design to user-facing interfaces."
        }
      ]
    },
    {
      "title": "Projects",
      "subsections": [
        {
          "title": "Real-world Booking Web Application (UP FLCD éLaan)",
          "subtitle": "Team of 5 | Fullstack, Agile, Client-based Internship",
          "from": {
            "year": 2024,
            "month": 7
          },
          "to": {
            "year": 2024,
            "month": 8
          },
          "items": [
            "Initiated and executed a freelance-style internship with a university department to digitize their booking workflow.",
            "Co-led the agile development process, facilitating sprint planning, task allocation, and regular client check-ins.",
            "Architected and implemented the core backend system, starting from a normalized PostgreSQL database schema.",
            "Developed dynamic, validated form workflows using SvelteKit, integrating frontend inputs with backend endpoints.",
            "Implemented role-based booking flows and data handling to support multiple user types and booking scenarios.",
            "Rapidly learned and applied Svelte, SvelteKit, and PostgreSQL to deliver a production-ready system within tight timelines.",
            "Reduced manual booking coordination by digitizing and centralizing requests into a single system used by department staff."
          ]
        },
        {
          "title": "IoT Companion Web Application (Labuddy)",
          "subtitle": "Team of 6 | Backend Lead, IoT Integration, Product Pitch",
          "from": {
            "year": 2024,
            "month": 2
          },
          "to": {
            "year": 2024,
            "month": 6
          },
          "items": [
            "Led backend development for an IoT-enabled laundry sorting system with a real-time web companion app.",
            "Designed and implemented a scalable backend using Supabase and MySQL to manage device data, user accounts, and transactions.",
            "Collaborated with frontend developers using React Native to ensure smooth API integration and data consistency.",
            "Contributed to UX flow and system behavior to ensure intuitive interaction between users and IoT hardware.",
            "Presented the system in a Dragon’s Den-style pitch, communicating technical feasibility and product value to evaluators.",
            "Enabled real-time monitoring of laundry sorting hardware, bridging physical IoT signals with a user-facing dashboard."
          ]
        },
        {
          "title": "QR-based Class Attendance System (RollCall)",
          "subtitle": "Team of 5 | Fullstack Mobile App, Agile Development",
          "from": {
            "year": 2023,
            "month": 9
          },
          "to": {
            "year": 2024,
            "month": 6
          },
          "items": [
            "Developed a mobile application that automates classroom attendance using QR code scanning and session validation.",
            "Implemented backend services using Supabase to handle authentication, attendance records, and course data.",
            "Designed normalized relational database schemas and access rules to ensure data integrity and prevent duplicate or invalid attendance logs.",
            "Integrated frontend Ionic React components with backend services to deliver real-time attendance feedback.",
            "Worked in an agile environment with weekly sprints, standups, and iterative improvements based on user testing.",
            "Actively participated in monthly standups with client team to align development with user needs and gather feedback for continuous improvement.",
            "Eliminated manual attendance tracking errors by automating QR-based session logging with validation safeguards."
          ]
        }
      ]
    },
    {
      "title": "Skills",
      "subsections": [
        {
          "items": {
            "Programming Languages": "TypeScript, JavaScript, Python, C, C#",
            "Frontend Development": "React (Ionic React, React Native), Svelte, SvelteKit, HTML, CSS",
            "Backend & Databases": "Supabase, PostgreSQL, MySQL, Authentication",
            "Development Tools": "Git, GitHub, VS Code, Figma",
            "Relevant Practices": "Agile Methodology, User & Software Documentation, Debugging",
            "Additional Experience": "IoT System Integration, QR Systems, Rapid Prototyping"
          }
        }
      ]
    },
    {
      "title": "Education",
      "subsections": [
        {
          "title": "Bachelor of Science in Computer Science",
          "subtitle": "University of the Philippines Diliman",
          "from": {
            "year": 2022,
            "month": 8
          },
          "to": {
            "year": 2026,
            "month": 7
          },
          "items": [
            "GWA: 1.68 (Cum Laude equivalent)",
            "Department of Science & Technology (DOST) Merit Scholar",
            "Relevant coursework: Software Engineering, Database Systems, Operating Systems, Computer Networks (IoT Systems), Data Structures & Algorithms, Programming Languages"
          ]
        }
      ]
    }
  ],
  "style": {
    "font": "Noto Sans",
    "font-size": "11pt",
    "header-color": "#000035",
    "divider-color": "#800000"
  }
}
